<script setup type="ts">

const rfh = [
  "燈燈燈燈😝☀️💡家人們👨‍👩‍👧‍👦國民黨💙其實我😂😂早在😎😎四年前🫤🫤就🤩🤗加入了😫😫😜😜被我耍😜😜了吧😊😊😊哈哈哈哈哈哈🤣🤣😂😂😂😂😆😆😆",
  "做錯事的又不是雙層四盎司牛肉吉士堡、大麥克、雙層牛肉吉事堡、麥香雞、麥克雞塊堡、安格斯黑牛堡、脆雞堡、辣味麥脆雞、勁辣雞腿堡、培根起司牛肉堡、培根起司雞肉堡、千島黃金蝦堡、麥香魚，所有牛肉漢堡酸黃瓜加量肉片加量醬料加量，麥香魚加點魚排，薯條加大加點加點搖搖薯加點卷卷薯條加點玉米湯、四塊麥克雞塊蜂蜜芥末醬加點Oreo冰炫風、巧克力布朗尼冰炫風、經典冰炫風、太妃糖冰炫風、沒有必要這樣。",
  "有天我去書局買了一本書叫89教科書 要用文化幣付款老闆說文化幣不能買沒文化的東西",
  `這邊我選89教科書
我不管你討厭誰，你敢討厭89教科書我就跟你沒完沒了。
我的命可以說是89教科書給的。
去年底的某一天，
我因爲一場嚴重車禍事件昏迷了三個月之久，醫生說我下半輩子基本就是個植物人了。
直到最近，
護士替我打完點滴後打開了收音機，放了89教科書的帕拉梅拉這首歌。
突然間，
我不知哪來的力量整個人爬起來就把收音機砸了。
這他媽的在唱什麼東西啊！`,
  `什麼第五人格（慌亂）（把手機熄屏）（四處張望）我不玩第五人格（慌亂地把手機藏到身後）（假裝冷靜）（試圖走近解釋）（摔倒）（狼狽爬起 ）（再跌倒）（著急）（抓你們褲腳）（驚慌）我不玩第五人格啊求求你們別鄙視我，求求你們不要不跟我玩（慌亂）我……我真的不玩第五人格（眼神四處亂瞟）（驚恐）（哭泣）（在地上打滾）（想起身後的手機）（丟掉手機）我…我手機是用來玩傳說對決的我真的沒有玩第五人格… …（發瘋）（跳走）（尖叫）你們不要問了啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊我真的很容易死的！ ！ ！ （陰暗地逃跑）`,
    `超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲)超級傳奇黑暗惡魔有感勇敢中國台灣香港狗狗貓貓培根菜鳥新手高手滑鼠香蕉的游戲解説頻道(挑戰690訂閲) I LOVE 笑銘ඞ I LOVE 有感筆電 I LOVE 路人!!!!!!!!!!!!!`,
    `歡迎大家加入這個是新的群組(我的🤓👍  會抽獎980r
 這個是以後的獎勵
這個群組100個人就等於200r
這個群組200個人就等於300r
這個群組300個人就等於500r
這個群組400個人就等於600r
這個群組到500個人就等於700r
這個群組到600個人就等於1000r
這個群組到達700,800,900人=900r
這個群組到1000人=1500r
但是如果現在到150個人的話呢=980r`,
    `李多慧是很努力的小女孩了,就算喜歡她,也要考慮到她的感受,人家都感到害怕了,如果有在關注多慧 的,就會知道,她已經環島很累了,下午也有活動,這樣搞得多慧和她的團隊不能回家休 息,這樣好嗎,人家也要有自己的隱私,這樣已經侵犯到多慧了,跟蹤真的很可惡,多慧的粉絲和多慧是無敵的,絕對不容忍這種行為,希望多慧平安,如果是新聞團隊的話那就更不能容忍了必要時一定要報警大家永遠站在你身邊 多慧加油`
]
const c = ref(rfh[Math.floor((Math.random()*rfh.length))])
</script>
<template>
  <v-container class="d-flex justify-center align-center" style="height: 100vh">
    <v-row class="w-100">
      <v-col cols="12" sm="8" md="6" lg="4">
        <v-card variant="flat"  prepend-icon="mdi-hammer">
          <template v-slot:title>
            頁面還沒寫好，待會再看看吧。
          </template>
          <v-card-text>
            你知道嗎
            <br>
            <p style="background-color: rgba(255,255,255,0.1); padding: 15px; border-radius: 5px; font-family: monospace">
              {{ c }}
            </p>
          </v-card-text>
          <v-card-actions style="margin-left: 5px">

            <v-btn @click="c = rfh[Math.floor((Math.random()*rfh.length))]">不知道</v-btn>
          </v-card-actions>
        </v-card>
      </v-col>
    </v-row>
  </v-container>
</template>

